#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/CONSUMER"]: Refreshing state... [id=b4c1e4bc-4bbd-4f37-966c-cc29bce30733/6578e80a-fbe5-4866-830d-76ac324c298c]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/CONSUMER"]: Refreshing state... [id=b4c1e4bc-4bbd-4f37-966c-cc29bce30733/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/CONSUMER"]: Refreshing state... [id=b4c1e4bc-4bbd-4f37-966c-cc29bce30733/d8799ef3-97b8-4f85-8f04-fb39cc8b813a]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/658f081c-a8b0-4c1b-b9ee-7e8901158ce7]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-MIDTIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/782fe94e-79a2-438f-9bc1-28717395b28d]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "DHT-DEV"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Digital Health Toolkit Dev Environment. The client is part of LRA integration."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "DHT-DEV"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:*",
          + "https://dev-smilecdr.htk.healthcarebc.ca/smart_auth/*",
          + "https://localhost:*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-LICENCE-STATUS will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-LICENCE-STATUS" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "LICENCE-STATUS"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Client Role Mapper for LICENCE-STATUS"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MD"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "652893c3-8e83-400e-9f6b-937e354f305c"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MOA"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "6167c7e5-aa86-4e6f-ba05-ecb9bb2aa7e8"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/PRACTITIONER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "d6669b04-2962-4bb3-ad33-5b92a3d784df"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/RNP"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "5e704cdc-3460-4f01-9707-9e919c8dc28c"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*